//РаботаСВнешнимОборудованием
Перем глПодключаемоеОборудование Экспорт; // для кэширования на клиенте
Перем глПодключаемоеОборудованиеСобытиеОбработано Экспорт; // для предотвращения повторной обработки события
Перем глДоступныеТипыОборудования Экспорт;
//Конец РаботаСВнешнимОборудованием

Процедура ПередНачаломРаботыСистемы(Отказ)
	
	ТекущийЗаголовок = ПолучитьЗаголовокКлиентскогоПриложения();
	УстановитьЗаголовокКлиентскогоПриложения(ТекущийЗаголовок+" ("+ПовторноеИспользованиеКлиент.ТекущийПользователь()+")");
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.ПередНачаломРаботыСистемы();
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

Процедура ПриНачалеРаботыСистемы()
	
	Если ИмяПользователя() = "Tasker1c" Тогда
		ОткрытьФорму("Обработка.ВыполнениеРегламентов.Форма");	
	КонецЕсли; 
	
	//// ПодключаемоеОборудование
	///МенеджерОборудованияКлиент.ПриНачалеРаботыСистемы();
	//// Конец ПодключаемоеОборудование
	
КонецПроцедуры


Процедура ОбработкаВнешнегоСобытия(Источник, Событие, Данные)
	
	глПодключаемоеОборудованиеСобытиеОбработано = Ложь;
	
	//РаботаСВнешнимОборудованием
	// Подготовить данные
	ОписаниеСобытия = Новый Структура();
	ОписаниеОшибки  = "";
	
	ОписаниеСобытия.Вставить("Источник", Источник);
	ОписаниеСобытия.Вставить("Событие",  Событие);
	ОписаниеСобытия.Вставить("Данные",   Данные);
	
	// Передать на обработку данные
	Результат = МенеджерОборудованияКлиент.ОбработатьСобытиеОтУстройства(ОписаниеСобытия, ОписаниеОшибки);
	Если Не Результат Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='При обработке внешнего события от устройства произошла ошибка.'")
		                                                 + Символы.ПС + ОписаниеОшибки);
	КонецЕсли;
	//Конец РаботаСВнешнимОборудованием
	
КонецПроцедуры

//глПодключаемоеОборудованиеСобытиеОбработано = Ложь;

