&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьСтоимость();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтоимость()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, Номенклатура = &Номенклатура) КАК ЦеныНоменклатурыСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	вт.Цена КАК Цена
	|ИЗ
	|	вт КАК вт";
	Запрос.УстановитьПараметр("Номенклатура", Объект.Ссылка);
	Рез = Запрос.Выполнить();
	Выб = Рез.Выбрать();
	Если Выб.Следующий() Тогда 
		Стоимость = Выб.Цена;
	Иначе
		Стоимость = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтоимостьНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если Модифицированность ИЛИ Параметры.Ключ.Пустая() Тогда
		ПоказатьПредупреждение(,"Необходимо записать элемент!");
		Возврат;
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("СпособДоставки", Объект.Ссылка);
	ПараметрыОткрытия.Вставить("СтараяСтоимость", Стоимость);
	
	Оповещение = Новый ОписаниеОповещения("РедактированиеСтоимостиПродолжение", ЭтаФорма);
	ОткрытьФорму("Справочник.СпособыДоставки.Форма.ВводНовойСтоимости", ПараметрыОткрытия, ЭтаФорма,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура РедактированиеСтоимостиПродолжение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьСтоимость();
	
КонецПроцедуры




