
Процедура ПередЗаписью(Отказ)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЭтоГруппа Тогда 
		ЗаполнитьСтрокуПоиска();
	КонецЕсли;
	
	Если ЭтоГруппа И Не Родитель = Справочники.Номенклатура.Опт И ОптРазрезыЗначения.Количество() > 0 Тогда 
		Отказ = Истина;
		Сообщить("Настройка разрезов доступна только для оптовых групп!", СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСтрокуПоиска()
	
	СтрокаПоиска = "";
	СтрокаПоиска = ""+СокрЛП(Артикул)
	+СокрЛП(IDНаСайте)
	+СокрЛП(Строка(ЕдиницаИзмерения))
	+Формат(Код,"ЧГ=0")
	+Строка(ВидНоменклатуры);
	Для Каждого Стр Из ДополнительныеРеквизиты Цикл
		СтрокаПоиска = СтрокаПоиска + СокрЛП(Строка(Стр.Значение));
	КонецЦикла;							
	
КонецПроцедуры


Процедура ПриЗаписи(Отказ)
	
	Если НЕ ОбменДанными.Загрузка Тогда
		
		//ЮРР 06.04.2017 9:39:41 Зарегистрировать в ПО
		Если Не ЭтоГруппа 
			И Не Родитель.Наименование = "Опт" 
			И ВыгружатьНаСайт Тогда
			
			Справочники.Номенклатура.ЗарегистрироватьВПО(Ссылка);			
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
