
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Наименование"); 
	Поля.Добавить("Код");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Представление = Данные.Наименование + " (" + БезНулей(Данные.Код) + ")";
	
КонецПроцедуры

Функция БезНулей(Строка)
	
	СтрокаБезНулей = "";
	
	ЗакончилисьНули = Ложь;
	Для НомерСимвола = 1 По СтрДлина(Строка) Цикл
		ТекСимвол = Сред(Строка, НомерСимвола, 1);
		Если ТекСимвол <> "0" Тогда
			ЗакончилисьНули = Истина;
		КонецЕсли;
		Если ЗакончилисьНули Тогда
			СтрокаБезНулей = СтрокаБезНулей + ТекСимвол;
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтрокаБезНулей;
	
КонецФункции
