
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	ДоступныеСклады = Новый СписокЗначений;
	ДоступныеСклады.Добавить(ПредопределенноеЗначение("Справочник.Склады.Саракташ"));
	ДоступныеСклады.Добавить(ПредопределенноеЗначение("Справочник.Склады.РынокСаракташ"));
	
	ПараметрыФормы = Новый Структура;
	Отбор = Новый Структура;
	Отбор.Вставить("Склад", ДоступныеСклады); //ПредопределенноеЗначение("Справочник.Склады.Саракташ"));
	Отбор.Вставить("Поставщик", ПовторноеИспользованиеКлиент.ПоставщикПроизводства());
	Если Не ЗначениеЗаполнено(Отбор.Поставщик) Тогда
		ВызватьИсключение "Не указан поставщик для производства в константе";
	КонецЕсли;
	ПараметрыФормы.Вставить("Отбор", Отбор);
	ОткрытьФорму("Документ.ПоступлениеТоваров.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, Новый УникальныйИдентификатор, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры
