
&НаКлиенте
Процедура ОК(Команда)
	
	Если ЦенаЗакупки <> СтараяЦена И ЦенаЗакупки <> 0 Тогда
		ЗаписатьНовуюЦену();
		Закрыть(Истина);
	Иначе
		Закрыть(Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть(Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтараяЦена = Параметры.СтараяЦена;
	Поставщик = Параметры.Поставщик;
	Номенклатура = Параметры.Номенклатура;
	ЦенаЗакупки = СтараяЦена;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНовуюЦену()
	
	Док = Документы.УстановкаЦенЗакупки.СоздатьДокумент();
	Док.Поставщик = Поставщик;
	Док.Дата = ТекущаяДата();
	нс = Док.Товары.Добавить();
	нс.Номенклатура = Номенклатура;
	нс.Цена = ЦенаЗакупки;
	Док.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры
