
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.Запасы.Очистить();
	Движения.Запасы.Записывать = Истина;
	
	Если Статус = "Закрыт" Тогда
		
		Для Каждого ТекСтрокаТовары Из Товары Цикл
			
			Если ТекСтрокаТовары.Отклонение = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Движение = Движения.Запасы.Добавить();
			Движение.Период = Дата;
			Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
			Движение.Склад = Склад;
			Движение.Количество = ТекСтрокаТовары.Отклонение;
			Если Движение.Количество > 0 Тогда 
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Иначе
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Количество = -1 * Движение.Количество;
			КонецЕсли;
			
		КонецЦикла;
		
		УчетСебестоимости.УчестьСебестоимость(ЭтотОбъект, Режим, Отказ);
		
	КонецЕсли;
	
КонецПроцедуры
