&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустой() Тогда    		
		Запись.ТипПравила = Перечисления.ТипыПравилУпаковки.ДляКаждогоЗаказа;  
	Иначе
		Если Запись.ТипПравила = ПредопределенноеЗначение("Перечисление.ТипыПравилУпаковки.ДляКаждогоЗаказа") Тогда
			//	
		ИначеЕсли Запись.ТипПравила = ПредопределенноеЗначение("Перечисление.ТипыПравилУпаковки.ДляКатегорииПозиции") Тогда
			Категория = Запись.Номенклатура;
			КоличествоТовара = запись.КоличествоТовара;
		ИначеЕсли Запись.ТипПравила = ПредопределенноеЗначение("Перечисление.ТипыПравилУпаковки.ДляКаждойПозиции") Тогда
			Номенклатура = Запись.Номенклатура;
			КоличествоТовара = запись.КоличествоТовара;
		КонецЕсли;
		Упаковка = Запись.Упаковка;
		КоличествоУпаковка = Запись.КоличествоУпаковка;       
	КонецЕсли;		
		
КонецПроцедуры   

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НастроитьВидФормы();

КонецПроцедуры

&НаКлиенте
Процедура НастроитьВидФормы()
	
	Если Запись.ТипПравила = ПредопределенноеЗначение("Перечисление.ТипыПравилУпаковки.ДляКаждогоЗаказа") Тогда
		Запись.Номенклатура = Неопределено;
		Запись.КоличествоУпаковка = 0;
		Элементы.Номенклатура.Видимость = Ложь;
		Элементы.Категория.Видимость = Ложь;
		Элементы.КоличествоТовара.Видимость = Ложь;
	ИначеЕсли Запись.ТипПравила = ПредопределенноеЗначение("Перечисление.ТипыПравилУпаковки.ДляКатегорииПозиции") Тогда
		Элементы.Номенклатура.Видимость = Ложь;
		Элементы.Категория.Видимость = Истина;
		Элементы.КоличествоТовара.Видимость = Истина; 
	ИначеЕсли Запись.ТипПравила = ПредопределенноеЗначение("Перечисление.ТипыПравилУпаковки.ДляКаждойПозиции") Тогда
		Элементы.Номенклатура.Видимость = Истина;
		Элементы.Категория.Видимость = Ложь;
		Элементы.КоличествоТовара.Видимость = Истина;    
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипПравилаПриИзменении(Элемент)
	
	 НастроитьВидФормы();	
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если НЕ ЗаполненоКорректно() Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Запись.ТипПравила = ПредопределенноеЗначение("Перечисление.ТипыПравилУпаковки.ДляКаждогоЗаказа") Тогда
		Запись.Номенклатура = Неопределено;
	ИначеЕсли Запись.ТипПравила = ПредопределенноеЗначение("Перечисление.ТипыПравилУпаковки.ДляКатегорииПозиции") Тогда
		Запись.Номенклатура = Категория;  
		Запись.КоличествоТовара = КоличествоТовара;
	ИначеЕсли Запись.ТипПравила = ПредопределенноеЗначение("Перечисление.ТипыПравилУпаковки.ДляКаждойПозиции") Тогда
		Запись.Номенклатура = Номенклатура;
		Запись.КоличествоТовара = КоличествоТовара;   
	КонецЕсли;
	Запись.Упаковка = Упаковка;
	Запись.КоличествоУпаковка = КоличествоУпаковка;
	
КонецПроцедуры

&НаКлиенте
Функция ЗаполненоКорректно()
	
	Если Запись.ТипПравила = ПредопределенноеЗначение("Перечисление.ТипыПравилУпаковки.ДляКатегорииПозиции") Тогда
		Если НЕ ЗначениеЗаполнено(Категория) Тогда
			ПоказатьПредупреждение(,"Не заполнена категория товара!",15);
			Возврат Ложь;
		КонецЕсли;
		Если КоличествоТовара <= 0 Тогда
			ПоказатьПредупреждение(,"Не заполнено количество товара в заказе!",15);
			Возврат Ложь;
		КонецЕсли;  	
	ИначеЕсли Запись.ТипПравила = ПредопределенноеЗначение("Перечисление.ТипыПравилУпаковки.ДляКаждойПозиции") Тогда
		Если КоличествоТовара <= 0 Тогда
			ПоказатьПредупреждение(,"Не заполнено количество товара в заказе!",15);
			Возврат Ложь;
		КонецЕсли; 		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции
