
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("ОбщаяФорма.", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	ПересчитатьПрибыльВЗаказахНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПересчитатьПрибыльВЗаказахНаСервере()
	
	Выборка = Документы.ЗаказПокупателя.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ПометкаУдаления Или Не Выборка.Проведен Тогда
			Продолжить;
		КонецЕсли;
		ОбъектЗаказ = Выборка.ПолучитьОбъект();
		ОбъектЗаказ.ДополнительныеСвойства.Вставить("РассчитатьПрибыль", Истина);
		ОбъектЗаказ.ОбменДанными.Загрузка = Истина;
		ОбъектЗаказ.Записать();
	КонецЦикла;
	
КонецПроцедуры