Функция ТекущийПользователь() Экспорт
	
	Возврат ПараметрыСеанса.ТекущийПользователь;
	
КонецФункции

// Определяет режим эксплуатации информационной базы файловый (Истина) или серверный (Ложь).
// При проверке используется СтрокаСоединенияИнформационнойБазы, которую можно указать явно.
//
// Параметры:
//  СтрокаСоединенияИнформационнойБазы - Строка - параметр используется, если
//                 нужно проверить строку соединения не текущей информационной базы.
//
// Возвращаемое значение:
//  Булево.
//
Функция ИнформационнаяБазаФайловая(Знач СтрокаСоединенияИнформационнойБазы = "") Экспорт
			
	Если ПустаяСтрока(СтрокаСоединенияИнформационнойБазы) Тогда
		СтрокаСоединенияИнформационнойБазы =  СтрокаСоединенияИнформационнойБазы();
	КонецЕсли;
	Возврат СтрНайти(ВРег(СтрокаСоединенияИнформационнойБазы), "FILE=") = 1;
	
КонецФункции

Функция ПоставщикПроизводства() Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Возврат Константы.ПоставщикДляПроизводства.Получить();	
КонецФункции

Функция РазмерДляПлатков() Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Возврат Константы.РазмерДляПлатков.Получить();	
КонецФункции

Функция ЭтоПользовательПроизводства() Экспорт
	Возврат РольДоступна("Производство");	
КонецФункции