
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отбор = Неопределено;
	Если Параметры.Свойство("Отбор", Отбор) Тогда
		Если Отбор.Свойство("Поставщик") И Отбор.Поставщик = ПовторноеИспользованиеСервер.ПоставщикПроизводства() Тогда
			ЭтоСаракташ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	ФормаДокументПоступлениеТоваровКомандаПечатьНаклеек = Элементы.Найти("ФормаДокументПоступлениеТоваровКомандаПечатьНаклеек");
	Если ЭтоСаракташ И  ФормаДокументПоступлениеТоваровКомандаПечатьНаклеек <> Неопределено Тогда
		ФормаДокументПоступлениеТоваровКомандаПечатьНаклеек.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	// Вставить содержимое обработчика.
КонецПроцедуры
