
&НаСервере
Процедура Команда1НаСервере()
	
	Выборка = Документы.ЗаказПокупателя.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ПометкаУдаления Или Выборка.ПрибыльСЗаказа <= 0 Тогда
			Продолжить;
		КонецЕсли;
		Об = Выборка.ПолучитьОбъект();
		Об.ПрибыльСЗаказаСУчетомДоставки = Об.ПрибыльСЗаказа - Об.СтоимостьДоставкиССайта - Об.СтоимостьДоставки;
		Об.ОбменДанными.Загрузка = Истина;
		Об.Записать();
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Команда1(Команда)
	Команда1НаСервере();
КонецПроцедуры

&НаСервере
Процедура Команда2НаСервере()
	Обработки.ВыполнениеРегламентов.Создать().СнятьТоварыСРезерва();
КонецПроцедуры

&НаКлиенте
Процедура Команда2(Команда)
	Команда2НаСервере();
КонецПроцедуры
