
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	СуммаДокумента = Товары.Итог("Сумма");
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.Запасы.Записывать = Истина;
	Движения.Продажи.Записывать = Истина;
	
	Слад = ?(ЗначениеЗаполнено(Заказ), Заказ.Склад, Справочники.Склады.НайтиПоКоду("000000001"));	//Основной
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		
		Движение = Движения.Запасы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Склад = Слад;
		Движение.Количество = ТекСтрокаТовары.Количество;
		
		Движение = Движения.Продажи.Добавить();		
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Сумма = -ТекСтрокаТовары.Сумма;
		Движение.Количество = -ТекСтрокаТовары.Количество;

	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда 
		
		Контрагент = ДанныеЗаполнения.Контрагент;
		Заказ = ДанныеЗаполнения;		
		Автор = ПараметрыСеанса.ТекущийПользователь;		
		
		Для Каждого Товар ИЗ ДанныеЗаполнения.Товары Цикл 
			
			нТовар = Товары.Добавить();
			нТовар.Номенклатура = Товар.Номенклатура;
			нТовар.ЕдиницаИзмерения = Товар.ЕдиницаИзмерения;
			нТовар.Количество = Товар.Количество;
			нТовар.Цена = Товар.Цена;
			нТовар.Сумма = Товар.Сумма;			
			
		КонецЦикла;
		
		СуммаДокумента = Товары.Итог("Сумма");		
		
	КонецЕсли;
	
КонецПроцедуры
