
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("Справочник.Бирки.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	Количество = 10;
	ОбработчикВвода = Новый ОписаниеОповещения("ВводКоличестваПродолжение", ЭтотОбъект, ПараметрыВыполненияКоманды.Источник);
	ПоказатьВводЧисла(ОбработчикВвода, Количество, "Сколько новых бирок?", 3, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ВводКоличестваПродолжение(Результат, Источник) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СоздатьБирки(Результат);
	
	Если ТипЗнч(Источник) = Тип("ФормаКлиентскогоПриложения")
		И Источник.ИмяФормы = "Справочник.Бирки.Форма.ФормаСписка" Тогда
		Источник.Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьБирки(Количество) 
	
	Для сч = 1 По Количество Цикл
		НоваяБирка = Справочники.Бирки.СоздатьЭлемент();
		НоваяБирка.УстановитьНовыйКод();
		НоваяБирка.Записать();
	КонецЦикла;	
	
КонецПроцедуры