&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ОптРазрезыЗначенияТипВязки.ОтборСтрок = Новый ФиксированнаяСтруктура("Разрез", ПолныеПрава.ПолучитьПеречисление("ОптРазрезыНоменклатуры", "ТипВязки"));
	Элементы.ОптРазрезыЗначенияЦвет.ОтборСтрок = Новый ФиксированнаяСтруктура("Разрез", ПолныеПрава.ПолучитьПеречисление("ОптРазрезыНоменклатуры", "Цвет"));
	Элементы.ОптРазрезыЗначенияРазмер.ОтборСтрок = Новый ФиксированнаяСтруктура("Разрез", ПолныеПрава.ПолучитьПеречисление("ОптРазрезыНоменклатуры", "Размер"));

КонецПроцедуры

&НаКлиенте
Процедура ОптРазрезыЗначенияЗначениеПриИзменении(Элемент)
	
	Если Элемент.Родитель.Имя = "ОптРазрезыЗначенияТипВязки" И Элементы.ОптРазрезыЗначенияТипВязки.ТекущиеДанные <> Неопределено Тогда
		Элементы.ОптРазрезыЗначенияТипВязки.ТекущиеДанные.Разрез = ПолныеПрава.ПолучитьПеречисление("ОптРазрезыНоменклатуры", "ТипВязки");
	ИначеЕсли Элемент.Родитель.Имя = "ОптРазрезыЗначенияЦвет" И Элементы.ОптРазрезыЗначенияЦвет.ТекущиеДанные <> Неопределено Тогда
		Элементы.ОптРазрезыЗначенияЦвет.ТекущиеДанные.Разрез = ПолныеПрава.ПолучитьПеречисление("ОптРазрезыНоменклатуры", "Цвет");
	ИначеЕсли Элемент.Родитель.Имя = "ОптРазрезыЗначенияРазмер" И Элементы.ОптРазрезыЗначенияРазмер.ТекущиеДанные <> Неопределено Тогда
		Элементы.ОптРазрезыЗначенияРазмер.ТекущиеДанные.Разрез = ПолныеПрава.ПолучитьПеречисление("ОптРазрезыНоменклатуры", "Размер");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УправлениеДопРеквизитами.ЗаполнитьДополнительныеРеквизиты(Параметры.Ключ,ЭтаФорма,Элементы.ГруппаДополнительно,АдресКэшаДопРеквизитов);
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныйРеквизитПриИзменении(Элемент)
	
	УправлениеДопРеквизитами.ПриИзмененииДополнительногоРеквизита(Элемент.Имя,ЭтаФорма[Элемент.Имя],АдресКэшаДопРеквизитов);		
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если НЕ Отказ Тогда
		УправлениеДопРеквизитами.ЗаписатьДополнительныеРеквизиты(ТекущийОбъект,АдресКэшаДопРеквизитов);
	КонецЕсли;
	
КонецПроцедуры
