
Процедура ПечатьСервер(ТДПечать, МакетПечати, мсВыбранныеДоки)
	
	Для Каждого Док ИЗ мсВыбранныеДоки Цикл 
		
		ТДПечатнаяФормаДокумента = Документы.ПоступлениеТоваров.ПолучитьПечатнуюФорму(Док, МакетПечати);			
		ТДПечать.Вывести(ТДПечатнаяФормаДокумента);
		
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	МакетПечати = "ПечатьНаклеек";
	
	ТДПечать = Новый ТабличныйДокумент;
	ПечатьСервер(ТДПечать, МакетПечати, ПараметрКоманды);
	ТДПечать.ОтображатьСетку = Ложь;
	ТДПечать.Защита = Ложь;
	ТДПечать.ТолькоПросмотр = Ложь;
	ТДПечать.ОтображатьЗаголовки = Ложь;
	ТДПечать.АвтоМасштаб = Истина;
	
	////Для наклеек свой принтер
	ТДПечать.ИмяПринтера = ПолныеПрава.ПолучитьЗначениеКонстанты("ИмяПринтераПечатьЭтикеток");
	ТДПечать.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	//ТДПечать.ПолеСверху = 4;
	//ТДПечать.ПолеСлева = 18;		
	//ТДПечать.ПолеСнизу = 2;
	//ТДПечать.ПолеСправа = 0;
	
	ТДПечать.ПолеСверху = 0;
	ТДПечать.ПолеСлева = 18;		
	ТДПечать.ПолеСнизу = 0;
	ТДПечать.ПолеСправа = 0;
	
	ТДПечать.Показать("Печать: Наклейки");
	
КонецПроцедуры
