
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ЭтоТранспортнаяКомпания") И Параметры.ЭтоТранспортнаяКомпания = Истина Тогда
		
		ОтборТранспортныеКомпании = Истина;
		Элементы.ГруппаОтборы.Видимость = Ложь;
		
	Иначе   	
		Если Параметры.Свойство("Опт") Тогда
			ОтборОпт = Параметры.Опт;
		КонецЕсли;
		
		Если Параметры.Свойство("Розница") Тогда
			ОтборРозница = Параметры.Розница;
		КонецЕсли;

		Если Параметры.Свойство("Покупатель") Тогда
			ОтборПокупатель = Параметры.Покупатель;
		КонецЕсли;

		Если Параметры.Свойство("Поставщик") Тогда
			ОтборПоставщик = Параметры.Поставщик;
		КонецЕсли;
		
		Если Параметры.Свойство("Служебный") Тогда
			ОтборСлужебные = Параметры.Служебный;
		КонецЕсли;  
		
		Если Не ОтборОпт И Не ОтборРозница Тогда
			ОтборРозница = Истина;
		КонецЕсли;
		
		Если Не ОтборПокупатель И Не ОтборПоставщик Тогда
			ОтборПокупатель = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьОтборы();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборы()
	
	Если ОтборТранспортныеКомпании Тогда
		УстановитьОтбор("ЭтоТранспортнаяКомпания", Истина);
	Иначе
		УстановитьОтбор("ЭтоТранспортнаяКомпания", Ложь);	
		УстановитьОтбор("Опт", ОтборОпт);
		УстановитьОтбор("Розница", ОтборРозница);
		УстановитьОтбор("Покупатель", ОтборПокупатель);
		УстановитьОтбор("Поставщик", ОтборПоставщик);
		УстановитьОтбор("Служебный", ОтборСлужебные);  
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтбор(ИмяПоля, ЗначениеПоля)
	
	ПолеОтбора = Новый ПолеКомпоновкиДанных(ИмяПоля);
	ЭлементОтбора = Неопределено;
	Для Каждого ЭлОтб Из Список.Отбор.Элементы Цикл
		Если ЭлОтб.ЛевоеЗначение = ПолеОтбора Тогда
			ЭлементОтбора = ЭлОтб;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ЭлементОтбора = Неопределено Тогда
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	КонецЕсли;
	
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ЛевоеЗначение = ПолеОтбора;
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = ЗначениеПоля;			
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОптПриИзменении(Элемент)
	
	УстановитьОтборы();
	
КонецПроцедуры

&НаСервере
Процедура СохранитьОтбор()
	
КонецПроцедуры
