
&НаСервере
Процедура ЗаполнитьДанныеВСправочникеНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДанныеСерийныхНомеров.СерийныйНомер КАК СерийныйНомер
	|ИЗ
	|	РегистрСведений.ДанныеСерийныхНомеров КАК ДанныеСерийныхНомеров";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		нз = РегистрыСведений.ДанныеСерийныхНомеров.СоздатьНаборЗаписей();
		нз.Отбор.СерийныйНомер.Установить(Выборка.СерийныйНомер);
		нз.Прочитать();
		нз.Записать();
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеВСправочнике(Команда)
	ЗаполнитьДанныеВСправочникеНаСервере();
КонецПроцедуры
