&НаКлиенте
Процедура УстановитьВидимость()
	
	ЭтоЮрЛицо = Объект.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ЮридическоеЛицо");
	Элементы.КодПоОКПО.Видимость = ЭтоЮрЛицо;
	Элементы.КПП.Видимость = ЭтоЮрЛицо;
	Элементы.РегистрационныйНомер.Видимость = ЭтоЮрЛицо;
	Элементы.СвидетельствоДатаВыдачи.Видимость = ЭтоЮрЛицо;
	Элементы.СвидетельствоСерияНомер.Видимость = ЭтоЮрЛицо;
	
	Элементы.СтраницаДополнительно.Видимость = Объект.Покупатель И Объект.Опт;  	
	Элементы.ГруппаФлагиКонтрагента.Видимость = Не Объект.ЭтоТранспортнаяКомпания;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидКонтрагентаПриИзменении(Элемент)
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ЮридическоеЛицо");
		КонтактныеЛица.Параметры.УстановитьЗначениеПараметра("Контрагент", NULL);
	Иначе
		КонтактныеЛица.Параметры.УстановитьЗначениеПараметра("Контрагент", Параметры.Ключ);
	КонецЕсли;
	
	Если Объект.Опт Тогда 
		Заказы.Параметры.УстановитьЗначениеПараметра("Контрагент", Объект.Ссылка);
		Элементы.ГруппаЗаказы.Видимость = Истина;
	Иначе
		Элементы.ГруппаЗаказы.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимость();  
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКонтактноеЛицо(Команда)
	
	Если Модифицированность Тогда
		ПоказатьПредупреждение(,"Контрагента необходимо записать!",15);
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Контрагент", Объект.Ссылка);
	ОткрытьФорму("Справочник.КонтактныеЛица.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьКонтактноеЛицо(Команда)
	
	Если Модифицированность Тогда
		ПоказатьПредупреждение(,"Контрагента необходимо записать!",15);
		Возврат;
	КонецЕсли;
	
	ТекДанные = Элементы.КонтактныеЛица.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПометкуУдаленияУКонтактногоЛица(ТекДанные.Ссылка);
	Элементы.КонтактныеЛица.Обновить(); 
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПометкуУдаленияУКонтактногоЛица(Знач Ссылка)
	
	Об = Ссылка.ПолучитьОбъект();
	Об.ПометкаУдаления = Истина;
	Об.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗаписьКонтактногоЛица" Тогда
		Элементы.КонтактныеЛица.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтоТранспортнаяКомпанияПриИзменении(Элемент)
	
	Если Объект.ЭтоТранспортнаяКомпания Тогда
		Объект.Покупатель = Ложь;
		Объект.Поставщик = Истина;
		Объект.Опт = Ложь;
		Объект.Розница = Ложь;
	КонецЕсли;
	
	УстановитьВидимость();
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаказыЗаказНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьЗначение(Элементы.Заказы.ТекущиеДанные);
КонецПроцедуры


&НаКлиенте
Процедура ЗаказыПередНачаломИзменения(Элемент, Отказ)
	ОткрытьЗначение(Элементы.Заказы.ТекущиеДанные.Заказ);
КонецПроцедуры


&НаКлиенте
Процедура КонтактнаяИнформацияПриАктивизацииЯчейки(Элемент)
	
	Если Элементы.КонтактнаяИнформация.ТекущиеДанные = Неопределено Тогда
		Возврат;		
	КонецЕсли;
	
	Попытка
		
		Если Элементы.КонтактнаяИнформация.ТекущиеДанные <> Неопределено
			И Элементы.КонтактнаяИнформация.ТекущиеДанные.Тип = ПолныеПрава.ПолучитьПеречисление("ТипыКонтактнойИнформации", "Отправитель") Тогда
			Элемент.ТекущийЭлемент.РежимВыбораИзСписка = Истина;
			Элемент.ТекущийЭлемент.СписокВыбора.Очистить();
			Элемент.ТекущийЭлемент.СписокВыбора.Добавить("");
			Элемент.ТекущийЭлемент.СписокВыбора.Добавить("Захаров");
			Элемент.ТекущийЭлемент.СписокВыбора.Добавить("Уваров");
		Иначе
			Элемент.ТекущийЭлемент.РежимВыбораИзСписка = Ложь;
			Элемент.ТекущийЭлемент.СписокВыбора.Очистить();
		КонецЕсли;
		
	Исключение
	КонецПопытки;
	
КонецПроцедуры

