
//Проверить соединение{
&НаСервере
Процедура ПроверитьСоединениеНаСервере()
	
	ОбработкаОбмена = Обработки.ОбменССайтом.Создать();	
	ОбработкаОбмена.УзелОбмена = РеквизитФормыВЗначение("Объект").Ссылка;
	
	стРезультат = Новый Структура("Результат,Ошибки");
	
	ОбработкаОбмена.ПроверитьАвторизацию(стРезультат);
	
	Сообщить("Выполнено с результатом: " + стРезультат.Результат 
	+ ?(ЗначениеЗаполнено(стРезультат.Ошибки), " , со следующими ошибками: " + стРезультат.Ошибки, ""));
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСоединение(Команда)
	
	ПроверитьСоединениеНаСервере();
	
КонецПроцедуры
//}Проверить соединение

//Загузить заказы{
&НаСервере
Процедура ЗагрузитьЗаказыНаСервере(ТолькоОбновитьСтоимость = Ложь, ДляТеста = Ложь)

	ОбработкаОбмена = Обработки.ОбменССайтом.Создать();	
	ОбработкаОбмена.УзелОбмена = РеквизитФормыВЗначение("Объект").Ссылка;
	
	стРезультат = Новый Структура("Результат,Ошибки");
	
	ОбработкаОбмена.ЗагрузитьЗаказы(стРезультат, ТолькоОбновитьСтоимость, ДляТеста);
	
	Сообщить("Выполнено с результатом: " + стРезультат.Результат 
	+ ?(ЗначениеЗаполнено(стРезультат.Ошибки), " , со следующими ошибками: " + стРезультат.Ошибки, ""));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьЗаказы(Команда)
	ЗагрузитьЗаказыНаСервере();
КонецПроцедуры
//}Загузить заказы

//Выгузить заказы{
&НаСервере
Процедура ВыгрузитьЗаказыНаСервере()
	
	ОбработкаОбмена = Обработки.ОбменССайтом.Создать();	
	ОбработкаОбмена.УзелОбмена = РеквизитФормыВЗначение("Объект").Ссылка;
	
	стРезультат = Новый Структура("Результат,Ошибки");
	
	ОбработкаОбмена.ВыгрузитьЗаказы(стРезультат);
	
	Сообщить("Выполнено с результатом: " + стРезультат.Результат 
	+ ?(ЗначениеЗаполнено(стРезультат.Ошибки), " , со следующими ошибками: " + стРезультат.Ошибки, ""));
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьЗаказы(Команда)
	ВыгрузитьЗаказыНаСервере();
КонецПроцедуры
//}Выгузить заказы

//Выгрузить товара и остатки с ценами{
&НаСервере
Процедура ВыгрузитьКаталогНаСервере()
	
	ОбработкаОбмена = Обработки.ОбменССайтом.Создать();	
	ОбработкаОбмена.УзелОбмена = РеквизитФормыВЗначение("Объект").Ссылка;
	
	стРезультат = Новый Структура("Результат,Ошибки");
	
	ОбработкаОбмена.ВыгрузитьКлассификаторИКаталог(стРезультат);
	
	Сообщить("Выполнено с результатом: " + стРезультат.Результат 
	+ ?(ЗначениеЗаполнено(стРезультат.Ошибки), " , со следующими ошибками: " + стРезультат.Ошибки, ""));
	

КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьКаталог(Команда)
	ВыгрузитьКаталогНаСервере();
КонецПроцедуры
//}Выгрузить товара и остатки с ценами

&НаСервере
Процедура ЗагрузитьПользователейНаСервере()
	
	ОбработкаОбмена = Обработки.ОбменССайтом.Создать();	
	ОбработкаОбмена.УзелОбмена = РеквизитФормыВЗначение("Объект").Ссылка;
	
	стРезультат = Новый Структура("Результат,Ошибки");
	
	ОбработкаОбмена.ЗагрузитьПользователей(стРезультат);
	
	Сообщить("Выполнено с результатом: " + стРезультат.Результат 
	+ ?(ЗначениеЗаполнено(стРезультат.Ошибки), " , со следующими ошибками: " + стРезультат.Ошибки, ""));
	
КонецПроцедуры


&НаКлиенте
Процедура ЗагрузитьПользователей(Команда)
	ЗагрузитьПользователейНаСервере();
КонецПроцедуры


&НаСервере
Процедура ВыгрузитьПользователейНаСервере()
	
	ОбработкаОбмена = Обработки.ОбменССайтом.Создать();	
	ОбработкаОбмена.УзелОбмена = РеквизитФормыВЗначение("Объект").Ссылка;
	
	стРезультат = Новый Структура("Результат,Ошибки");
	
	ОбработкаОбмена.ВыгрузитьПользователей(стРезультат);
	
	Сообщить("Выполнено с результатом: " + стРезультат.Результат 
	+ ?(ЗначениеЗаполнено(стРезультат.Ошибки), " , со следующими ошибками: " + стРезультат.Ошибки, ""));
	
КонецПроцедуры


&НаКлиенте
Процедура ВыгрузитьПользователей(Команда)
	ВыгрузитьПользователейНаСервере();
КонецПроцедуры


&НаСервере
Процедура ЗагрузитьДанныеСФормыОбратнойСвязиНаСервере()
	
	ОбработкаОбмена = Обработки.ОбменССайтом.Создать();	
	ОбработкаОбмена.УзелОбмена = РеквизитФормыВЗначение("Объект").Ссылка;
	
	стРезультат = Новый Структура("Результат,Ошибки");
	
	ОбработкаОбмена.ЗагрузитьДанныеСФормыОбратнойСвязи(стРезультат);
	
	Сообщить("Выполнено с результатом: " + стРезультат.Результат 
	+ ?(ЗначениеЗаполнено(стРезультат.Ошибки), " , со следующими ошибками: " + стРезультат.Ошибки, ""));	

КонецПроцедуры


&НаКлиенте
Процедура ЗагрузитьДанныеСФормыОбратнойСвязи(Команда)
	ЗагрузитьДанныеСФормыОбратнойСвязиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьТоварыНаСервере()	
	
	ОбработкаОбмена = Обработки.ОбменССайтом.Создать();	
	ОбработкаОбмена.УзелОбмена = РеквизитФормыВЗначение("Объект").Ссылка;
	
	стРезультат = Новый Структура("Результат, Ошибки");
	
	ОбработкаОбмена.ЗагрузитьТовары(стРезультат);
	
	Сообщить("Выполнено с результатом: " + стРезультат.Результат 
	+ ?(ЗначениеЗаполнено(стРезультат.Ошибки), " , со следующими ошибками: " + стРезультат.Ошибки, ""));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьТовары(Команда)
	ЗагрузитьТоварыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьОстаткиТоваровНаСервере()
	
	ОбработкаОбмена = Обработки.ОбменССайтом.Создать();	
	ОбработкаОбмена.УзелОбмена = РеквизитФормыВЗначение("Объект").Ссылка;
	
	стРезультат = Новый Структура("Результат,Ошибки");
	
	ОбработкаОбмена.ВыгрузитьОстаткиТоваров(стРезультат);
	
	Сообщить("Выполнено с результатом: " + стРезультат.Результат 
	+ ?(ЗначениеЗаполнено(стРезультат.Ошибки), " , со следующими ошибками: " + стРезультат.Ошибки, ""));
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьОстаткиТоваров(Команда)
	ВыгрузитьОстаткиТоваровНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьЗаказыТолькоОбновитьСтоимость(Команда)
	ЗагрузитьЗаказыНаСервере(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьЗаказыТест(Команда)
	ЗагрузитьЗаказыНаСервере(, Истина);
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьСерийныеНомераНаСервере(ПолнаяВыгрузка = Истина)
	
	ОбработкаОбмена = Обработки.ОбменССайтом.Создать();	
	ОбработкаОбмена.УзелОбмена = РеквизитФормыВЗначение("Объект").Ссылка;
	
	стРезультат = Новый Структура("Результат,Ошибки");
	
	ОбработкаОбмена.ВыгрузитьСерийныеНомера(стРезультат, ПолнаяВыгрузка);
	
	Сообщить("Выполнено с результатом: " + стРезультат.Результат 
	+ ?(ЗначениеЗаполнено(стРезультат.Ошибки), " , со следующими ошибками: " + стРезультат.Ошибки, ""));

КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьСерийныеНомераПолностью(Команда)
	ВыгрузитьСерийныеНомераНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьСерийныеНомераТолькоИзмененныеИНовые(Команда)
	ВыгрузитьСерийныеНомераНаСервере(Ложь);  
КонецПроцедуры
