Процедура РассчитатьСуммуТЧ(СтрокаТЧ, ЭтоПродажа = Истина) Экспорт
	
	Если СтрокаТЧ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		Если Не ЗначениеЗаполнено(СтрокаТЧ.ЕдиницаИзмерения) Тогда // сделать нормально!
			СтрокаТЧ.ЕдиницаИзмерения = СлужебныйСервер.ЕдиИзм(СтрокаТЧ.Номенклатура);
		КонецЕсли;
	Исключение
	КонецПопытки;			
	
	//СтрокаТЧ.Сумма = СтрокаТЧ.Количество*?(ЭтоПродажа,СтрокаТЧ.Цена,СтрокаТЧ.ЦенаЗакупки);
	СтрокаТЧ.Сумма = СтрокаТЧ.Количество*СтрокаТЧ.Цена;
	
КонецПроцедуры

Процедура РассчитатьСуммуТЧПоСкидке(СтрокаТЧ, ИзменилсяПроцент = Истина) Экспорт
	
	Если СтрокаТЧ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		Если Не ЗначениеЗаполнено(СтрокаТЧ.ЕдиницаИзмерения) Тогда // сделать нормально!
			СтрокаТЧ.ЕдиницаИзмерения = СлужебныйСервер.ЕдиИзм(СтрокаТЧ.Номенклатура);
		КонецЕсли;
	Исключение
	КонецПопытки;			
	
	СтСумма = ?(ЗначениеЗаполнено(СтрокаТЧ.Сумма),СтрокаТЧ.Сумма,СтрокаТЧ.Количество*СтрокаТЧ.Цена);
	Если ИзменилсяПроцент Тогда
		СтрокаТЧ.СуммаСкидки = СтСумма/100*СтрокаТЧ.ПроцентСкидкиНаценки;
		СтрокаТЧ.Сумма = СтСумма-СтрокаТЧ.СуммаСкидки;
	Иначе
		СтрокаТЧ.ПроцентСкидкиНаценки = ?(СтСумма=0,0,СтрокаТЧ.СуммаСкидки/СтСумма*100);
		СтрокаТЧ.Сумма = СтСумма-СтрокаТЧ.СуммаСкидки;
	КонецЕсли;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// Функции для обработки действий пользователя в процессе редактирования
// многострочного текста, например комментария в документах.

// Открывает форму редактирования произвольного многострочного текста.
//
// Параметры:
//  ОповещениеОЗакрытии     - ОписаниеОповещения - содержит описание процедуры, которая будет вызвана 
//                            после закрытия формы ввода текста с теми же параметрами, что и для метода
//                            ПоказатьВводСтроки.
//  МногострочныйТекст      - Строка - произвольный текст, который необходимо отредактировать;
//  Заголовок               - Строка - текст, который необходимо отобразить в заголовке формы.
//
// Пример:
//
//   Оповещение = Новый ОписаниеОповещения("КомментарийЗавершениеВвода", ЭтотОбъект);
//   ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияМногострочногоТекста(Оповещение, Элемент.ТекстРедактирования);
//
//   &НаКлиенте
//   Процедура КомментарийЗавершениеВвода(Знач ВведенныйТекст, Знач ДополнительныеПараметры) Экспорт
//      Если ВведенныйТекст = Неопределено Тогда
//		   Возврат;
//   	КонецЕсли;	
//	
//	   Объект.МногострочныйКомментарий = ВведенныйТекст;
//	   Модифицированность = Истина;
//   КонецПроцедуры
//
Процедура ПоказатьФормуРедактированияМногострочногоТекста(Знач ОповещениеОЗакрытии, 
	Знач МногострочныйТекст, Знач Заголовок = Неопределено) Экспорт
	
	Если Заголовок = Неопределено Тогда
		ПоказатьВводСтроки(ОповещениеОЗакрытии, МногострочныйТекст,,, Истина);
	Иначе
		ПоказатьВводСтроки(ОповещениеОЗакрытии, МногострочныйТекст, Заголовок,, Истина);
	КонецЕсли;
	
КонецПроцедуры

// Открывает форму редактирования многострочного комментария.
//
// Параметры:
//  МногострочныйТекст      - Строка - произвольный текст, который необходимо отредактировать.
//  ФормаВладелец 			- УправляемаяФорма - форма, в поле которой выполняется ввод комментария.
//  ИмяРеквизита            - Строка - имя реквизита формы, в который будет помещен введенный пользователем
//                                     комментарий.
//  Заголовок               - Строка - текст, который необходимо отобразить в заголовке формы.
//                                     По умолчанию: "Комментарий".
//
// Пример использования:
//
//	 ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
//
Процедура ПоказатьФормуРедактированияКомментария(Знач МногострочныйТекст, Знач ФормаВладелец, Знач ИмяРеквизита, 
	Знач Заголовок = Неопределено) Экспорт
	
	ДополнительныеПараметры = Новый Структура("ФормаВладелец,ИмяРеквизита", ФормаВладелец, ИмяРеквизита);
	Оповещение = Новый ОписаниеОповещения("КомментарийЗавершениеВвода", ЭтотОбъект, ДополнительныеПараметры);
	ЗаголовокФормы = ?(Заголовок <> Неопределено, Заголовок, НСтр("ru='Комментарий'"));
	ПоказатьФормуРедактированияМногострочногоТекста(Оповещение, МногострочныйТекст, ЗаголовокФормы);
	
КонецПроцедуры
