Функция ПолучитьПечатнуюФорму(Ссылка, МакетПечати, ДополнительныеПараметры = Неопределено) Экспорт 
	
	ТД = Новый ТабличныйДокумент;
	
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.ПоступлениеТоваров") Тогда
		Док = Ссылка.ПолучитьОбъект();
	Иначе
		Док = Ссылка;
	КонецЕсли;
	
	Если МакетПечати = "ПечатьНаклеек" Тогда
		
		Если Не Док.Опт Тогда
			
			Если Константы.ИспользоватьРедактируемыйМакетНаклейки.Получить() = Истина Тогда
				
				ХЗ = Константы.Наклейка.Получить();
				ДД = ХЗ.Получить();
				ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");
				ДД.Записать(ИмяВременногоФайла);
				
				Макет = Новый ТабличныйДокумент;
				Макет.Прочитать(ИмяВременногоФайла);
				
			Иначе
				
				Макет = Документы.ПоступлениеТоваров.ПолучитьМакет("Наклейка");
				
			КонецЕсли;
			
		Иначе
			
			Если Константы.ИспользоватьРедактируемыйМакетНаклейкиОпт.Получить() = Истина  Тогда
				
				ХЗ = Константы.НаклейкаОпт.Получить();
				ДД = ХЗ.Получить();
				ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");
				ДД.Записать(ИмяВременногоФайла);
				
				Макет = Новый ТабличныйДокумент;
				Макет.Прочитать(ИмяВременногоФайла);
				
			Иначе
				
				Макет = Документы.ПоступлениеТоваров.ПолучитьМакет("Наклейка");
				
			КонецЕсли;
			
		КонецЕсли;
		
		облТекст = Макет.ПолучитьОбласть("ОбластьТекст1");
		облШК = Макет.ПолучитьОбласть("ОбластьШК");
		
		//Данные по товарам
		Для Каждого Строка Из Док.Товары Цикл
			
			Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") И ДополнительныеПараметры.Свойство("ТолькоТовар") И ДополнительныеПараметры.ТолькоТовар <> Строка.НомерСтроки Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			Для Сч=1 По Строка.Количество Цикл //Печатать наклеек на изделия столько, сколько штук изделий
				
				Если Строка.Номенклатура.НеПечататьЭтикетку = Истина Тогда 
					Продолжить;
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(Строка.Номенклатура) Тогда 
					Продолжить;	
				КонецЕсли;
				
				//////////ТоварТекст = "Артикул: " + Символы.ПС + " " + Строка.Номенклатура.Артикул + Символы.ПС;
				//////////
				////////////Состав
				//////////нСтроки = Строка.Номенклатура.ДополнительныеРеквизиты.НайтиСтроки(Новый Структура("Свойство",ПланыВидовХарактеристик.ДополнительныеРеквизиты.НайтиПоНаименованию("Состав")));
				//////////Для Каждого нСтрока Из нСтроки Цикл				
				//////////	ТоварТекст = ТоварТекст + "Состав: " + Символы.ПС + " " + нСтрока.Значение + Символы.ПС;				
				//////////КонецЦикла;
				//////////
				////////////Производство
				//////////нСтроки = Строка.Номенклатура.ДополнительныеРеквизиты.НайтиСтроки(Новый Структура("Свойство",ПланыВидовХарактеристик.ДополнительныеРеквизиты.НайтиПоНаименованию("Производство")));
				//////////Для Каждого нСтрока Из нСтроки Цикл				
				//////////	ТоварТекст = ТоварТекст + "Производство: " + Символы.ПС + " " + нСтрока.Значение + Символы.ПС;				
				//////////КонецЦикла;
				//////////
				////////////Цвет
				//////////нСтроки = Строка.Номенклатура.ДополнительныеРеквизиты.НайтиСтроки(Новый Структура("Свойство",ПланыВидовХарактеристик.ДополнительныеРеквизиты.НайтиПоНаименованию("Цвет")));
				//////////Для Каждого нСтрока Из нСтроки Цикл				
				//////////	ТоварТекст = ТоварТекст + "Цвет: " + Символы.ПС + " " + нСтрока.Значение + Символы.ПС;				
				//////////КонецЦикла;
				//////////
				////////////Размер
				//////////нСтроки = Строка.Номенклатура.ДополнительныеРеквизиты.НайтиСтроки(Новый Структура("Свойство",ПланыВидовХарактеристик.ДополнительныеРеквизиты.НайтиПоНаименованию("Размер")));
				//////////Для Каждого нСтрока Из нСтроки Цикл				
				//////////	ТоварТекст = ТоварТекст + "Размер: " + Символы.ПС + " " + нСтрока.Значение + Символы.ПС;
				//////////КонецЦикла;
				//////////
				////////////S/N
				//////////
				//////////СтрокаЦена = Формат(Строка.Цена, "ЧДЦ=; ЧГ=0");
				//////////
				//////////Цена1 = Сред(Прав("00000" + СтрокаЦена, 5), 1, 1);
				//////////Цена2 = Сред(Прав("00000" + СтрокаЦена, 5), 2, 1);
				//////////Цена3 = Сред(Прав("00000" + СтрокаЦена, 5), 3, 1);
				//////////Цена4 = Сред(Прав("00000" + СтрокаЦена, 5), 4, 1);
				//////////Цена5 = Сред(Прав("00000" + СтрокаЦена, 5), 5, 1);
				//////////
				//////////Гсч = Новый ГенераторСлучайныхЧисел();
				//////////Гсч.СлучайноеЧисло(1,99);
				//////////
				////////////"12-ХХ3-45"
				//////////ТоварТекст = ТоварТекст + "S/N: " + Символы.ПС + " " + Цена1 + Цена2 + "-" + Гсч.СлучайноеЧисло(10,99) + Цена3 + "-" + Цена4 + Цена5 + Символы.ПС;
				//////////
				//////////облТекст.Параметры.Текст = ТоварТекст;
				
				///
				стПараметры = Новый Структура;
				
				стПараметры.Вставить("Артикул", Строка.Номенклатура.Артикул);

				//Состав
				нСтроки = Строка.Номенклатура.ДополнительныеРеквизиты.НайтиСтроки(Новый Структура("Свойство",ПланыВидовХарактеристик.ДополнительныеРеквизиты.НайтиПоНаименованию("Состав")));
				Для Каждого нСтрока Из нСтроки Цикл				
					стПараметры.Вставить("Состав", нСтрока.Значение);
				КонецЦикла;
				
				//Производство
				нСтроки = Строка.Номенклатура.ДополнительныеРеквизиты.НайтиСтроки(Новый Структура("Свойство",ПланыВидовХарактеристик.ДополнительныеРеквизиты.НайтиПоНаименованию("Производство")));
				Для Каждого нСтрока Из нСтроки Цикл				
					стПараметры.Вставить("Производство", нСтрока.Значение);
				КонецЦикла;
				
				//Цвет
				нСтроки = Строка.Номенклатура.ДополнительныеРеквизиты.НайтиСтроки(Новый Структура("Свойство",ПланыВидовХарактеристик.ДополнительныеРеквизиты.НайтиПоНаименованию("Цвет")));
				Для Каждого нСтрока Из нСтроки Цикл				
					стПараметры.Вставить("Цвет", нСтрока.Значение);
				КонецЦикла;
				
				//Размер
				нСтроки = Строка.Номенклатура.ДополнительныеРеквизиты.НайтиСтроки(Новый Структура("Свойство",ПланыВидовХарактеристик.ДополнительныеРеквизиты.НайтиПоНаименованию("Размер")));
				Для Каждого нСтрока Из нСтроки Цикл				
					стПараметры.Вставить("Размер", нСтрока.Значение);
				КонецЦикла;
				
				//S/N
				
				СтрокаЦена = Формат(Строка.Цена, "ЧДЦ=; ЧГ=0");
				
				Цена1 = Сред(Прав("00000" + СтрокаЦена, 5), 1, 1);
				Цена2 = Сред(Прав("00000" + СтрокаЦена, 5), 2, 1);
				Цена3 = Сред(Прав("00000" + СтрокаЦена, 5), 3, 1);
				Цена4 = Сред(Прав("00000" + СтрокаЦена, 5), 4, 1);
				Цена5 = Сред(Прав("00000" + СтрокаЦена, 5), 5, 1);
				
				Гсч = Новый ГенераторСлучайныхЧисел();
				Гсч.СлучайноеЧисло(1,99);
				
				
				//"12-ХХ3-45"
				SN = " " + Цена1 + Цена2 + "-" + Гсч.СлучайноеЧисло(10,99) + Цена3 + "-" + Цена4 + Цена5;
				
				стПараметры.Вставить("SN", SN);
				
				облТекст.Параметры.Заполнить(стПараметры);
				
				///
				
				ТД.Вывести(облТекст);
				
				
				//Вывод ШК
				Попытка
					
					облШК.Рисунки.ШК.Объект.ТипКода = 4;
					//Штрихкод =
					//	Формат(?(ЗначениеЗаполнено(Док.Дата), Док.Дата, ТекущаяДата()), "ДФ=yyMMdd") + 
					//	Прав("0000" + Формат(Строка.Номенклатура.IDНаСайте, "ЧДЦ=; ЧГ=0"), 4) +	
					//	Прав("00000" + Формат(Строка.Цена, "ЧДЦ=; ЧГ=0"), 5);
					Если Не Строка.Номенклатура.ОптовыйТовар Тогда
						Штрихкод =
							Формат(Док.Дата, "ДФ=yyMMdd") + 
							Прав("0000" + Формат(Строка.Номенклатура.IDНаСайте, "ЧДЦ=; ЧГ=0"), 4) +	
							Прав("00000" + Формат(Строка.Цена, "ЧДЦ=; ЧГ=0"), 5);
					Иначе
						Штрихкод = СлужебныйСервер.ШтрихкодНоменклатуры(Строка.Номенклатура);	
					КонецЕсли;

						
					облШК.Рисунки.ШК.Объект.СодержитКС = Истина;
					облШК.Рисунки.ШК.Объект.ТекстКода = Штрихкод;					
					облШК.Рисунки.ШК.Объект.Сообщение = Штрихкод;
					
				Исключение
				КонецПопытки;
				
				ТД.Вывести(облШК);
				
				
				ТД.ВывестиГоризонтальныйРазделительСтраниц();
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ТД;
	
КонецФункции

Процедура ЗаполнитьТабличнуюЧастьСерийныхНомеров() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПоступлениеТоваровТовары.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПоступлениеТоваров.Товары КАК ПоступлениеТоваровТовары
	|ГДЕ
	|	ПоступлениеТоваровТовары.СерийныйНомер <> &СерийныйНомер";
	Запрос.УстановитьПараметр("СерийныйНомер", Справочники.СерийныеНомера.ПустаяСсылка());
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Об = Выборка.Ссылка.ПолучитьОбъект();
		Об.СерийныеНомера.Очистить();
		Для Каждого Стр Из Об.Товары Цикл
			Стр.КлючСтроки = Новый УникальныйИдентификатор;
			нс = Об.СерийныеНомера.Добавить();
			нс.КлючСтроки = Стр.КлючСтроки;
			нс.СерийныйНомер = Стр.СерийныйНомер;
		КонецЦикла;
		Об.Записать(?(Об.Проведен И Не Об.ПометкаУдаления, РежимЗаписиДокумента.Проведение, Неопределено));
	КонецЦикла;
	
КонецПроцедуры