
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ДенежныеСредства Расход
	Движения.ДенежныеСредства.Записывать = Истина;
	Движение = Движения.ДенежныеСредства.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.КассаСчет = Счет;
	Движение.Сумма = СуммаДокумента;

	// регистр Расходы 
	Движения.Расходы.Записывать = Истина;
	Для Каждого ТекСтрокаРасшифровка Из Расшифровка Цикл
		Если ТекСтрокаРасшифровка.Статья = Справочники.СтатьиРасходов.КорректировкаОстатков Тогда
			Продолжить;
		КонецЕсли;
		Движение = Движения.Расходы.Добавить();
		Движение.Период = Дата;
		Движение.Статья = ТекСтрокаРасшифровка.Статья;
		Движение.Сумма = ТекСтрокаРасшифровка.Сумма;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	
	Движения.Взаиморасчеты.Записывать = Истина;
	Для Каждого Стр Из Расшифровка Цикл
		Если ТипЗнч(Стр.Сделка) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
			Движение = Движения.Взаиморасчеты.ДобавитьРасход();
			Движение.Период = Дата;
			Движение.Контрагент = Стр.Сделка.Контрагент;
			Движение.Сделка = Стр.Сделка; 			
			Движение.Сумма = -Стр.Сумма; 
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	СуммаДокумента = Расшифровка.Итог("Сумма");
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя") Тогда
		// Заполнение шапки
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		// Заполнение шапки
		Контрагент = ДанныеЗаполнения.Контрагент;
		нс = Расшифровка.Добавить();
		нс.Сделка = ДанныеЗаполнения;
		нс.Статья = Справочники.СтатьиРасходов.ВозвратОплатыПокупателю;
		нс.Сумма = ДанныеЗаполнения.СуммаДокумента;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		// Заполнение шапки
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
