
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЦветОбъекта = Объект.Ссылка.Цвет.Получить();
	ШрифтОбъекта = Объект.Ссылка.Шрифт.Получить();
	
	Цвет = ?(Параметры.Ключ.Пустая() ИЛИ ЦветОбъекта = Неопределено,Новый Цвет(0,0,0),ЦветОбъекта);
	Шрифт = ?(Параметры.Ключ.Пустая() ИЛИ ШрифтОбъекта = Неопределено,Новый Шрифт("Обычный шрифт текста"),ШрифтОбъекта);   
	
	//Элементы.IDНаСайте.ТолькоПросмотр = НЕ Объект.Предопределенный;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.Цвет = Новый ХранилищеЗначения(?(Цвет = Новый Цвет(0,0,0),Неопределено,Цвет));
	ТекущийОбъект.Шрифт = Новый ХранилищеЗначения(?(Шрифт = Новый Шрифт("Обычный шрифт текста"),Неопределено,Шрифт));
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ИзмененЭлементСтатусЗаказа");
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Цвет = Новый Цвет(0,0,0);
	
КонецПроцедуры

&НаКлиенте
Процедура ШрифтОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Шрифт = Новый Шрифт("Обычный шрифт текста"); 
	
КонецПроцедуры
